class Scripted(object):    


    PROGRESS_DIS = """\n
★─────[**🔅پروژه جدید🔅**]─────★

<b>✅ : {1} | {2}</b>

<b>📊 درصد انجام شده فایل :  {0}%</b>

<b>🚀سرعت : {3}/s</b>

<b>⏱️تایم باقی مانده : {4}</b>

 ★──────[**@FarshidBand**]──────★"""

    HELP_TEXT = """
<b>📚 #راهنمای_ربات</b>\n\n
<b>✵ ابتدا فایل را به این ربات ارسال کنید. </b>\n
<b>⭕️ برای تغییرنام دادن فایل ها ↓\n✵روی فایل های ارسالی خود ریپلی کنید و سپس دستور /rename را تایپ سپس نام جدید فایل را وارد کنید.👇\n\n→ /rename [نام جدید فایل][.mp4] ←</b>\n
<b>⭕️ برای تبدیل فایل به ویدیو ↓\n✵ روی فایل ارسالی خود ریپلی کنید سپس دستور /convert ارسال کنید.!</b>\n\n
<b>✵ برای دیدن تصویر بند انگشتی خود از دستور /sthumbnail استفاده کنید.</b>\n
<b>✵ برای حذف تصویر بند انگشتی خود از دستور /dthumbnail استفاده کنید.</b>\n
<b>🛠️ مدیر ربات : @FarshidBand ▪️</b>"""


    ABOUT_TEXT = """
★──────────∆──────────★

<b>🤖 نام ربات : : <a href='https://t.me/ir_renamebot'>تغییرنام فایل</a></b>

<b>📢 کانال : <a href='https://t.me/SeriesPlus1'>Series+</a></b>

<b>👥 گروه پشتیبانی : <a href='https://t.me/dlchinhub'>Group</a></b>

<b>👨‍💻 سازنده ربات : <a href='https://t.me/FarshidBand'>F∆RSHID-B∆ND</a></b>

★──────[Thanks 😊]─────★"""

    CUSTOM_CAPTION = "<i>{}</i>"
    ACCESS_DENIED = "<b>🚫 دسترسی شما به ربات بدلیل ارسال مطالب خیراخلاقی مسدود شد.</b>"
    BANNED_USER_TEXT = "<i>🚫 دسترسی شما به ربات بدلیل ارسال مطالب خیراخلاقی مسدود شد.</i>"
    TRYING_TO_UPLOAD = "<b>در حال آپلود ...</b>"
    CURRENT_THUMBNAIL = "<b>🔺 تصویر انتخاب شده شما🙂</b>"
    THUMBNAIL_SAVED = "<b>📸 تصویر بند انگشتی(تامبنیل) با موفقیت  ثبت شد.</b>"
    THUMBNAIL_DELETED = "<b>📸 تصویر بند انگشتی(تامبنیل) با موفقیت حذف شد.</b>"
    NO_THUMBNAIL_FOUND = "<b>❌ هیچ تصویر (تامبینل) ی یافت نشد.</b>"
    TRYING_TO_DOWNLOAD = "<b>♨️ در حال دانلود فایل ...</b>"
    UPLOAD_SUCCESS = "<u><b>🏁 پروژه تغییرنام با موفقیت انجام شد.👇</b></u>"
    REPLY_TO_MEDIA = "<b>✅ برای تبدیل فایل به ویدیو\n\n🔚روی فایل ارسالی خود ریپلی کنید سپس دستور /convert ارسال کنید.! </b>"
    UPLOAD_START = "<i>📤  در حال آپلود فایل ...</i>\n"
    DOWNLOAD_START = "<i>📥 در حال دانلود فایل...</i>\n"
    JOIN_NOW_TEXT = "<b>• برای استفاده از ربات باید در کانال زیر عضو شوید سپس /start را کلیک کنید.👇</b>"
    REPLY_TO_FILE = "<b>⚠ روی فایل های ارسالی خود ریپلی کنید و سپس دستور /rename را تایپ سپس نام جدید فایل را وارد کنید.👇\n\n→ /rename [نام جدید فایل][.mp4] ←</b>"
    CONTACT_MY_DEVELOPER = "<b>🥺 مشکلی پیش آمد. <a href='https://t.me/FarshidBand'> [گزارش به ادمین]</a></b>"
    START_TEXT = "<b>🌺 سلام دوست عزیز خوش آمدید  😎\n\n🔘 من ربات کاربردی تغییرنام فایل هستم.\nمیتوانید با استفاده از من فایل های خود را با سرعت بالا تغییرنام دهید. \n\n📚 راهنمای ربات ← /help • \n\n🛠 سازنده ربات : @FarshidBand •</b>"
    UPGRADE_TEXT = "<b>♻ کانال اطلاع رسانی آپدیت های ربات <a href='https://t.me/seriesplus1'>[ کلیک کنید]</a></b>"
